
save_path = "E:\\7DC2-PUB\\"    # 保存位置
save_filename_part = "天第"
save_type = ".mp4"

# # 运行模式 test | prod
# run_method = "prod"

# # 专辑名(day)
# epic = 2002

# 视频时长(s)
counter_long = [
    60 * 53 + 33,   # 第1集 
    60 * 63 + 10,   # 第2集 
    60 * 41 + 10,   # 第3集 
    60 * 61 + 20,   # 第4集 
    60 * 47 + 24,   # 第5集 
    60 * 53 +  8,   # 第6集       
    60 * 69 +  4,   # 第7集       
    # 60 * 71 + 18,   # 第8集       
    # 60 * 63 + 23,   # 第9集       
    # 60 * 58 +  5,   # 第10集
    ]

# 指定需要录制的集数
record_list = [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6,
    # 7,
    # 8,
    # 9,
    ]