
save_path = "E:\\7DC2-PUB\\"    # 保存位置
save_filename_part = "天第"
save_type = ".mp4"

# # 运行模式 test | prod
# run_method = "prod"

# # 专辑名(day)
# epic = 2002

# 视频时长(s)
counter_long = [
    # 60 * 63 + 45,   # 第1集 19
    # 60 * 49 +  0,   # 第2集 19
    # 60 * 48 + 30,   # 第3集 19
    # 60 * 52 + 44,   # 第4集 19
    60 * 56 + 48,   # 第1集 
    60 * 56 + 43,   # 第2集 
    60 * 44 + 49,   # 第3集 
    60 * 45 + 30,   # 第4集 
    60 * 67 + 42,   # 第5集 
    60 * 50 + 17,   # 第6集       
    60 * 73 + 14,   # 第7集       
    # 60 * 71 + 18,   # 第8集       
    # 60 * 63 + 23,   # 第9集       
    # 60 * 58 +  5,   # 第10集
    ]

# 指定需要录制的集数
record_list = [
    # 0, 
    # 1, 
    # 2, 
    # 3, 
    # 4, 
    # 5, 
    6,
    # 7,
    # 8,
    # 9,
    # 10,
    ]